amrincurveUP/CrustSense-SmartCrabSystem/firmware/smart-aquaculture-firmware/sdkconfig.defaults
# ESP32-S3-N16R8 defaults — no menuconfig needed for basic sensor bring-up
CONFIG_IDF_TARGET="esp32s3"

CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_ESPTOOLPY_FLASHMODE_DIO=y
CONFIG_ESPTOOLPY_FLASHFREQ_80M=y

CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_SPEED_40M=y

CONFIG_ESP_CONSOLE_USB_SERIAL_JTAG=y
